[
  {
    "id": 1,
    "user_id": 1,
    "username": "Janvi",
    "recipeName": "Spaghetti Carbonara",
    "dishType": "Pasta",
    "prepTime": "20 mins",
    "shelfLife": "3-4 days refrigerated",
    "difficulty": "Moderate",
    "image": "uploads\\1725185675732-carbonara-horizontal-articleLarge-v2.webp",
    "ingredients": "8 oz spaghetti\r\n4 slices bacon, diced\r\n2 garlic cloves, minced\r\n2 eggs\r\n1/2 cup grated Parmesan cheese\r\n1/4 cup heavy cream\r\nSalt and pepper to taste\r\nChopped parsley for garnish",
    "description": "Spaghetti Carbonara is a classic Italian pasta dish made with spaghetti, crispy bacon, and a creamy sauce of eggs and Parmesan cheese.Perfect for a satisfying weeknight dinner!",
    "directions": "Bring a large pot of salted water to a boil. Cook the spaghetti according to package instructions until al dente. Drain and set aside.\r\nIn a skillet, cook the diced bacon over medium heat until crispy, about 5-7 minutes. Remove bacon from skillet and drain on paper towels, reserving 2 tbsp bacon fat in the skillet.\r\nIn a small bowl, whisk together the eggs, Parmesan, heavy cream, salt and pepper. Set aside.\r\nIn the skillet with the bacon fat, sauté the minced garlic over medium heat for 1 minute until fragrant.\r\nRemove skillet from heat and immediately add the cooked spaghetti and egg mixture. Toss quickly to coat the pasta, allowing the residual heat to cook the eggs into a creamy sauce.\r\nStir in the crispy bacon pieces.\r\nServe immediately, garnished with chopped parsley. Enjoy!"
  },
  {
    "id": 2,
    "user_id": 1,
    "username": "Janvi",
    "recipeName": "Chicken Biryani",
    "dishType": "Main course",
    "prepTime": "60 mins",
    "shelfLife": "3-4 days refrigerated ",
    "difficulty": "Difficult",
    "image": "uploads\\1725186121315-chicken-biryani.jpg",
    "ingredients": "2 cups basmati rice\r\n500g chicken, cut into pieces\r\n1 large onion, thinly sliced\r\n2 tomatoes, chopped\r\n1/2 cup yogurt\r\n2-3 green chilies, slit\r\n4-5 cloves of garlic, minced\r\n1-inch ginger, minced\r\nWhole spices (2-3 cardamom pods, 2-3 cloves, 1 cinnamon stick)\r\n1/2 tsp turmeric powder\r\n1 tsp red chili powder\r\n1 tsp garam masala\r\nFresh cilantro and mint leaves, chopped\r\n4 cups water\r\nSalt to taste\r\n3 tbsp cooking oil or ghee",
    "description": "Chicken Biryani is a fragrant and flavorful rice dish made with basmati rice, tender chicken, and aromatic spices.Perfect for special occasions or a comforting family dinner!",
    "directions": "Rinse the basmati rice in cold water until the water runs clear. Soak for 30 minutes, then drain.\r\nIn a large pot, heat oil or ghee over medium heat. Add whole spices and sauté until fragrant.\r\nAdd sliced onions and cook until golden brown. Stir in minced garlic and ginger, and cook for another minute.\r\nAdd chicken pieces, chopped tomatoes, yogurt, green chilies, turmeric, red chili powder, and salt. Cook until chicken is tender.\r\nIn a separate pot, bring 4 cups of water to a boil. Add soaked rice and cook until it's 70% done. Drain the rice.\r\nLayer the partially cooked rice over the chicken mixture. Sprinkle garam masala, chopped cilantro, and mint leaves on top.\r\nCover the pot with a tight-fitting lid and cook on low heat for 20-25 minutes until the rice is fully cooked and flavors meld.\r\nServe hot with raita or salad."
  },
  {
    "id": 3,
    "user_id": 1,
    "username": "Janvi",
    "recipeName": "Momo",
    "dishType": "Dumplings",
    "prepTime": "45 mins",
    "shelfLife": "2-3 days refrigerated",
    "difficulty": "Moderate",
    "image": "uploads\\1725186302035-20231220030332-andy-20cooks-20-20chicken-20momo.webp",
    "ingredients": "For the Filling:\r\n250g ground chicken\r\n1 onion, finely chopped\r\n2 garlic cloves, minced\r\n1-inch ginger, grated\r\n1 tsp soy sauce\r\n1 tsp sesame oil\r\n1/2 tsp red chili powder\r\nSalt to taste\r\nChopped cilantro\r\nFor the Dough:\r\n2 cups all-purpose flour\r\n1/2 tsp salt\r\n3/4 cup warm water",
    "description": "Chicken Momos are delicious Nepali-style dumplings filled with minced chicken, onions, garlic, and aromatic spices. These steamed parcels are made with a simple dough and are perfect as an appetizer or a snack. Dip them in a savory sauce for an authentic taste of Himalayan cuisine.",
    "directions": "In a bowl, mix all the filling ingredients and set aside.\r\nIn another bowl, combine flour and salt. Add warm water and knead into a smooth dough. Cover and let it rest for 30 minutes.\r\nDivide the dough into lime-sized balls. Roll each ball into a thin circle.\r\nPlace a tablespoon of filling in the center of the circle. Wet the edges with water and fold the dough over to form a half-moon shape. Pinch the edges to seal.\r\nBring a large pot of water to a boil. Gently place the momos in the boiling water. Cover and cook for 8-10 minutes until they float to the top.\r\nServe hot with dipping sauce of your choice (such as soy sauce, vinegar, and chili oil)."
  },
  {
    "id": 4,
    "user_id": 1,
    "username": "Janvi",
    "recipeName": "Crispy Corn",
    "dishType": "Snack",
    "prepTime": "20 mins",
    "shelfLife": "2-3 days stored in an airtight container",
    "difficulty": "Easy",
    "image": "uploads\\1725186480488-Crispy_Corn_Chat_400.jpg",
    "ingredients": "2 cups fresh or frozen corn kernels\r\n2 tbsp all-purpose flour\r\n1 tsp paprika\r\n1/2 tsp garlic powder\r\n1/2 tsp onion powder\r\n1/4 tsp cayenne pepper (optional)\r\nSalt to taste\r\n2 tbsp oil for frying",
    "description": "Crispy Corn is a delightful snack made with fresh or frozen corn kernels coated in a flavorful seasoned flour mixture and fried until crispy. This easy-to-make appetizer is perfect for parties or movie nights.",
    "directions": "Pat the corn kernels dry with a paper towel to remove any excess moisture.\r\nIn a bowl, mix together the flour, paprika, garlic powder, onion powder, cayenne pepper (if using), and salt.\r\nAdd the corn kernels to the seasoned flour mixture and toss to coat evenly.\r\nHeat oil in a skillet over medium-high heat. Once the oil is hot, add the coated corn kernels in a single layer.\r\nFry for 3-4 minutes, stirring occasionally, until the corn is crispy and golden brown.\r\nRemove the crispy corn from the oil using a slotted spoon and transfer to a paper towel-lined plate to drain excess oil.\r\nServe hot as a snack or appetizer. Enjoy!"
  },
  {
    "id": 5,
    "user_id": 1,
    "username": "Janvi",
    "recipeName": "Rajma Chawal",
    "dishType": "Rice and Curry",
    "prepTime": "90 mins",
    "shelfLife": "2-3 days refrigerated ",
    "difficulty": "Easy",
    "image": "uploads\\1725186851680-images.jpeg",
    "ingredients": "1 cup red kidney beans, soaked overnight\r\n1 onion, chopped\r\n2 cloves garlic, minced\r\n1 inch ginger, grated\r\n1 tomato, chopped\r\n1 teaspoon cumin seeds\r\n1 teaspoon coriander powder\r\n1/2 teaspoon red chili powder\r\n1/2 teaspoon turmeric powder\r\n1/2 teaspoon garam masala\r\n1/2 teaspoon salt\r\n1/4 teaspoon amchur powder\r\n2 cups water\r\n1 cup basmati rice\r\nGhee or oil for tempering\r\nFresh coriander leaves for garnish\r\n",
    "description": "Rajma Chawal is a classic North Indian dish featuring tender red kidney beans cooked in a flavorful tomato-based gravy, served with fluffy basmati rice. This hearty and satisfying meal is perfect for any occasion and can be prepared in about 1 hour 30 minutes. The dish has a shelf life of 2-3 days when refrigerated and is considered easy to make.",
    "directions": "Cook the rice: Rinse the basmati rice and cook according to package instructions.\r\nPrepare the gravy: Heat ghee or oil in a pressure cooker. Add cumin seeds and let them sizzle. Add chopped onions, garlic, and ginger. Sauté until fragrant.\r\nAdd spices: Stir in tomato, coriander powder, red chili powder, turmeric powder, garam masala, and salt. Cook until the tomatoes break down and the mixture becomes thick.\r\nSimmer the beans: Add the soaked red kidney beans and water. Pressure cook for 2-3 whistles or until the beans are tender. If using a regular pot, simmer until the beans are soft.\r\nThicken the gravy: Add amchur powder and adjust the consistency with water. Simmer for a few minutes.\r\nServe: Garnish with fresh coriander leaves. Serve hot with cooked basmati rice."
  },
  {
    "id": 6,
    "user_id": 1,
    "username": "Janvi",
    "recipeName": "Ghewar",
    "dishType": "Dessert",
    "prepTime": "60 mins",
    "shelfLife": "3-4 days (stored in an airtight container)",
    "difficulty": "Moderate",
    "image": "uploads\\1725186987016-images (1).jpeg",
    "ingredients": "1 cup all-purpose flour (maida)\r\n1/4 cup ghee (clarified butter)\r\n1/2 cup cold water\r\nA pinch of baking soda\r\n1/4 teaspoon cardamom powder\r\nGhee for deep frying\r\n1 cup sugar\r\n1/2 cup water (for sugar syrup)\r\nChopped nuts (almonds, pistachios) for garnish\r\nSilver leaf (optional) for decoration",
    "description": "Ghewar is a traditional Indian sweet made from a batter of all-purpose flour and ghee, deep-fried to create a honeycomb-like structure. Soaked in sugar syrup and garnished with nuts, this festive dessert is especially popular during celebrations like Teej and Raksha Bandhan. Enjoy its unique texture and sweetness!",
    "directions": "Prepare the batter: In a mixing bowl, combine all-purpose flour, ghee, and a pinch of baking soda. Gradually add cold water while whisking to form a smooth batter. The batter should be of pouring consistency.\r\nHeat the ghee: In a deep frying pan, heat enough ghee for deep frying.\r\nFry the Ghewar: Once the ghee is hot, pour a ladleful of the batter into the center of the hot ghee. It will spread out and form a round shape. Fry until the edges turn golden brown. Remove and drain on paper towels.\r\nPrepare the sugar syrup: In a saucepan, combine sugar and 1/2 cup water. Heat until the sugar dissolves completely. Add cardamom powder and simmer for a few minutes to form a light syrup.\r\nSoak the Ghewar: Dip the fried Ghewar into the warm sugar syrup for a few seconds, allowing it to soak up the sweetness.\r\nGarnish and serve: Place the Ghewar on a serving plate, garnish with chopped nuts, and add silver leaf if desired. Serve warm or at room temperature."
  },
  {
    "id": 7,
    "user_id": 1,
    "username": "Janvi",
    "recipeName": "Ramen",
    "dishType": "Noodle Soup",
    "prepTime": "60 mins",
    "shelfLife": "1-2 days (refrigerated)",
    "difficulty": "Medium",
    "image": "uploads\\1725187344847-images (2).jpeg",
    "ingredients": "For the Broth:\r\n4 cups chicken or pork broth\r\n2 cups water\r\n2 tablespoons soy sauce\r\n1 tablespoon miso paste (optional)\r\n1 inch ginger, sliced\r\n2 cloves garlic, minced\r\n1 tablespoon sesame oil\r\nFor the Noodles:\r\n2 servings of ramen noodles (fresh or dried)\r\nToppings:\r\nSoft-boiled eggs\r\nSliced green onions\r\nNori (seaweed)\r\nSliced cooked pork (chashu)\r\nBean sprouts\r\nCorn (optional)\r\nBamboo shoots (menma)",
    "description": "Ramen is a flavorful Japanese noodle soup made with a rich broth, tender ramen noodles, and a variety of toppings such as soft-boiled eggs, sliced pork, and green onions. This comforting dish can be customized with different ingredients and is perfect for a satisfying meal any time.",
    "directions": "Prepare the Broth: In a large pot, combine chicken or pork broth, water, soy sauce, miso paste (if using), ginger, garlic, and sesame oil. Bring to a simmer and let it cook for about 20-30 minutes to develop the flavors.\r\nCook the Noodles: While the broth is simmering, cook the ramen noodles according to the package instructions. Drain and set aside.\r\nPrepare the Toppings: Soft-boil the eggs by simmering them in boiling water for about 6-7 minutes. Remove and place them in ice water to cool. Once cooled, peel and slice in half. Prepare other toppings like sliced green onions, nori, and chashu.\r\nAssemble the Ramen: In a bowl, place a serving of cooked ramen noodles. Pour the hot broth over the noodles. Top with soft-boiled egg halves, sliced pork, green onions, nori, bean sprouts, corn, and bamboo shoots.\r\nServe: Enjoy your homemade ramen hot!"
  },
  {
    "id": 8,
    "user_id": 1,
    "username": "Janvi",
    "recipeName": "Healthy Chicken Rice Bowl",
    "dishType": "Main Course",
    "prepTime": "30 mins",
    "shelfLife": "3-4 days (refrigerated)",
    "difficulty": "Easy",
    "image": "uploads\\1725187539457-delish-190522-cilantro-lime-chicken-and-rice-bowl-portrait-046-pf-1-1559073830.jpg",
    "ingredients": "1 cup cooked brown rice or quinoa\r\n200g chicken breast, diced\r\n1 tablespoon olive oil\r\n1 teaspoon garlic powder\r\n1 teaspoon onion powder\r\n1 teaspoon paprika\r\nSalt and pepper to taste\r\n1 cup mixed vegetables (broccoli, bell peppers, carrots, etc.)\r\n1 tablespoon soy sauce (low sodium)\r\nFresh herbs for garnish (cilantro or parsley)",
    "description": "This Healthy Chicken Rice Bowl features tender chicken breast and colorful mixed vegetables served over a base of brown rice or quinoa. Quick and easy to prepare, this nutritious meal is packed with protein and fiber, making it a perfect choice for a wholesome lunch or dinner. Enjoy it with a drizzle of soy sauce for added flavor!",
    "directions": "Cook the Rice: Prepare brown rice or quinoa according to package instructions. Set aside.\r\nCook the Chicken: In a skillet, heat olive oil over medium heat. Add diced chicken breast and season with garlic powder, onion powder, paprika, salt, and pepper. Cook until the chicken is no longer pink and cooked through, about 5-7 minutes.\r\nAdd Vegetables: Add mixed vegetables to the skillet and stir-fry for another 3-5 minutes until they are tender-crisp.\r\nCombine: Add the cooked rice or quinoa to the skillet. Pour in the soy sauce and mix everything well until heated through.\r\nServe: Divide the chicken and vegetable mixture into bowls. Garnish with fresh herbs and serve hot."
  },
  {
    "id": 9,
    "user_id": 1,
    "username": "Janvi",
    "recipeName": "Watermelon Mojito",
    "dishType": "Cocktail/Mocktail",
    "prepTime": "10 mins",
    "shelfLife": "Best consumed fresh",
    "difficulty": "Easy",
    "image": "uploads\\1725187986829-images (3).jpeg",
    "ingredients": "2 cups fresh watermelon, cubed\r\n10-12 fresh mint leaves\r\n1 lime, juiced\r\n2 tablespoons sugar or honey (adjust to taste)\r\n1 cup club soda or sparkling water\r\nIce cubes\r\nMint sprigs and watermelon slices for garnish",
    "description": "The Watermelon Mojito is a refreshing cocktail that combines sweet watermelon juice, fresh mint, and zesty lime for a perfect summer drink. Easy to make and incredibly hydrating, this vibrant beverage is ideal for parties or a relaxing day at home. Enjoy it with or without alcohol!",
    "directions": "Prepare the Watermelon: In a blender, blend the watermelon cubes until smooth. Strain the juice through a fine mesh sieve to remove pulp if desired.\r\nMuddle the Mint: In a glass, add the mint leaves and sugar (or honey). Use a muddler or the back of a spoon to gently press the mint leaves to release their oils.\r\nAdd Lime Juice: Pour the freshly squeezed lime juice into the glass and mix well with the muddled mint.\r\nCombine: Add the watermelon juice to the glass and stir to combine all the ingredients.\r\nServe: Fill the glass with ice cubes and top with club soda or sparkling water. Stir gently to mix.\r\nGarnish: Garnish with mint sprigs and a slice of watermelon. Serve immediately and enjoy!"
  },
  {
    "id": 10,
    "user_id": 3,
    "username": "Rachit",
    "recipeName": "Watermelon mojito",
    "dishType": "Drinks",
    "prepTime": "10mins",
    "shelfLife": "sdfv",
    "difficulty": "easy",
    "image": "uploads\\1725513224563-images (3).jpeg",
    "ingredients": "wessdrftg v",
    "description": "afef",
    "directions": "edswfrcev"
  }
]